app/controllers/shorts_controller.rb

  def index
    @shorts = Short.all
---
SELECT "shorts".* FROM "shorts"

  def show
   if @short.nil?

    render json: {
        error: "The shortcode cannot be found in the system"
      }, status: 404
   else
    @short.update_attribute(:clicked, @short.clicked + 1)
---
UPDATE "shorts" SET "updated_at" = ?, "redirectcount" = ? WHERE "shorts"."id" = ?  [["updated_at", "2021-12-17 07:46:00.331992"], ["redirectcount", 1], ["id", 1]]

  def stat
    @short=Short.find_by_shorturl(params[:slug])
    if @short.nil?

      render json: {
        error: "The shortcode cannot be found in the system"
      }, status: 404
    else

      render status: 200, json:
      {
         "Startdate": @short.created_at,
         "Lastdate": @short.updated_at,
         "redirectCount": @short.clicked,
     }
---
SELECT "shorts".* FROM "shorts" WHERE "shorts"."shorturl" = ? LIMIT ?  [["shorturl", "aasasa"], ["LIMIT", 1]]
INSERT INTO "shorts" ("url", "created_at", "updated_at", "shortcode") VALUES (?, ?, ?, ?)  [["url", "http://google.com"], ["created_at", "2021-12-19 09:35:13.216462"], ["updated_at", "2021-12-19 09:35:13.216462"], ["shortcode", "112SaB"]]

  def create
    @short = Short.new(short_params)
    if @short.shorturl.nil?
      @short.shorturl=@short.shorten
    else
      @short.shorturl=@short.shorturl
    end

    if @short.save
---
INSERT INTO "shorts" ("url", "shorturl", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "http://rrrrt.co.id/hvvvv/"], ["shorturl", "123zxc"], ["created_at", "2021-12-16 02:54:51.629602"], ["updated_at", "2021-12-16 02:54:51.629602"]]

  def destroy
    @short.destroy
---
DELETE FROM "shorts" WHERE "shorts"."id" = ?  [["id", 1]]

    def set_short
      @short = Short.find_by_shorturl(params[:slug])
---
SELECT "shorts".* FROM "shorts" WHERE "shorts"."shorturl" = ? LIMIT ?  [["shorturl", "favicon"], ["LIMIT", 1]]