app/controllers/shorts_controller.rb

SELECT "shorts".* FROM "shorts" WHERE "shorts"."shortcode" = ? LIMIT ?  [["shortcode", "8be2ca"], ["LIMIT", 1]]
---
  def stat
    @short=Short.find_by_shortcode(params[:shortcode])

SELECT "shorts".* FROM "shorts" WHERE "shorts"."id" BETWEEN ? AND ?  [["id", 15], ["id", 32]]
---
  def destroy
    @short=Short.where(id: 3..55).destroy_all

SELECT "shorts".* FROM "shorts" WHERE "shorts"."shortcode" = ? LIMIT ?  [["shortcode", "b7b362"], ["LIMIT", 1]]
---
    def set_short
      @short = Short.find_by_shortcode(params[:shortcode])